In [1]:
import pandas as pd

df = pd.read_csv('BC_Final_clean.csv')
df.head()

,User_ID,Age,Address,Book_Rating,ISBN,Book_Title,Book_Author,Year_Of_Publication,Publisher
0,2,18.0,"stockton, california, usa",0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press
1,11400,49.0,"ottawa, ontario, canada",0,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada
2,11400,49.0,"ottawa, ontario, canada",9,0786868716,The Five People You Meet in Heaven,Mitch Albom,2003,Hyperion
3,11400,49.0,"ottawa, ontario, canada",6,0151008116,Life of Pi,Yann Martel,2002,Harcourt
4,11400,49.0,"ottawa, ontario, canada",0,0671021001,She's Come Undone (Oprah's Book Club),Wally Lamb,1998,Pocket

In [2]:
df.describe()

             User_ID            Age    Book_Rating  Year_Of_Publication
count  745349.000000  745349.000000  745349.000000        745349.000000
mean   140880.564585      37.155656       2.773089          1967.902625
std     78624.603205      11.932006       3.866416           232.482632
min         2.000000      10.000000       0.000000             0.000000
25%     74172.000000      28.000000       0.000000          1992.000000
50%    140879.000000      35.000000       0.000000          1997.000000
75%    208141.000000      45.000000       7.000000          2001.000000
max    278852.000000      85.000000      10.000000          2050.000000

In [3]:
df.shape

(745349, 9)

In [9]:
zeroes = df['Year_Of_Publication'] == 0
zeroes.value_counts()

False    735100
True      10249
Name: Year_Of_Publication, dtype: int64

In [21]:
df['Book_Rating'].value_counts()

0     478272
8      64200
10     53540
7      45114
9      44869
5      27383
6      21235
4       5042
3       3286
2       1541
1        867
Name: Book_Rating, dtype: int64

In [18]:
isbns = df['ISBN'] == ''
isbns.value_counts()

False    745349
Name: ISBN, dtype: int64

In [22]:
df_filtered = df[df['Year_Of_Publication'] != 0]
df_filtered.describe()

             User_ID            Age    Book_Rating  Year_Of_Publication
count  735100.000000  735100.000000  735100.000000        735100.000000
mean   140900.184164      37.181196       2.769388          1995.339755
std     78618.089807      11.935535       3.865586             7.433836
min         2.000000      10.000000       0.000000          1376.000000
25%     74215.000000      28.000000       0.000000          1992.000000
50%    140974.000000      35.000000       0.000000          1997.000000
75%    208141.000000      45.000000       7.000000          2001.000000
max    278852.000000      85.000000      10.000000          2050.000000

In [23]:
df_filtered_again = df_filtered[df_filtered['Book_Rating'] > 0]
df_filtered_again.describe()

             User_ID            Age    Book_Rating  Year_Of_Publication
count  263008.000000  263008.000000  263008.000000        263008.000000
mean   138092.380338      36.742361       7.740362          1995.761353
std     78826.116405      12.162215       1.813123             7.553983
min        19.000000      10.000000       1.000000          1376.000000
25%     72163.000000      28.000000       7.000000          1993.000000
50%    135265.000000      35.000000       8.000000          1998.000000
75%    206365.500000      45.000000       9.000000          2001.000000
max    278852.000000      85.000000      10.000000          2050.000000

In [24]:
df_filtered_again.to_csv('BC_Final_clean_again.csv')